make.sh started at 2024-09-10 16:00:04
Executing: bash my_shell_script.sh
Executing: StataSE-64 wrangle_data.do

  ___  ____  ____  ____  ____ ®
 /__    /   ____/   /   ____/      StataNow 18.5
___/   /   /___/   /   /___/       SE—Standard Edition

 Statistics and Data Science       Copyright 1985-2023 StataCorp LLC
                                   StataCorp
                                   4905 Lakeway Drive
                                   College Station, Texas 77845 USA
                                   800-782-8272        https://www.stata.com
                                   979-696-4600        service@stata.com

Stata license: Unlimited-user network, expiring 15 Aug 2025
Serial number: 401809300744
  Licensed to: Luca Moreno Louzada
               MIT

Notes:
      1. Stata is running in batch mode.
      2. Unicode is supported; see help unicode_advice.
      3. Maximum number of variables is set to 5,000 but can be increased;
          see help set_maxvar.

. do wrangle_data.do 

. * ===========================================================================
> ==
. * Short description of script's purpose
. * ===========================================================================
> ==
. 
. clear all

. adopath + "../../lib/stata"
  [1]  (BASE)      "C:\Program Files\Stata18\ado\base/"
  [2]  (SITE)      "C:\Program Files\Stata18\ado\site/"
  [3]              "."
  [4]  (PERSONAL)  "C:\Users\lucam\ado\personal/"
  [5]  (PLUS)      "C:\Users\lucam\ado\plus/"
  [6]  (OLDPLACE)  "c:\ado/"
  [7]              "../../lib/stata"

. set linesize 100

. 
. * =============================================================================
. 
. program main
  1.     insheet using "../input/mpg.csv", comma clear
  2.     clean_data
  3.     save "../output/mpg.dta", replace
  4. end

. 
. program clean_data
  1.     di ""
  2.     * Some data wrangling steps here
. end

. 
. * Execute
. main
(11 vars, 234 obs)

(file ../output/mpg.dta not found)
file ../output/mpg.dta saved

. 
end of do-file
make.sh finished at 2024-09-10 16:00:04
